Autodesk.Navisworks.Api.Schema.ComplexField
Intermediate base class for all complex structural Fields.

Autodesk.Navisworks.Api.Schema.ComplexField.IsReadOnly
Gets a value indicating whether the object is read-only.